Optimizing sales for specialty food distributor - data-driven insights with SQL
===
---

In [1]:
# ? imports and settings

---
# Executive summary

---
# Input data and transformations

Data and database schema is available [here](https://github.com/pthom/northwind_psql/tree/master). We use this data to create a `northwind` database on a PostgreSQL server. First, we install relevant packages to interact with the database.

In [2]:
!pip install ipython-sql
!pip install python-decouple
# !pip install psycopg2 # Python integration

%load_ext sql

Requirement already satisfied: ipython-sql in c:\users\malec\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\malec\anaconda3\lib\site-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: ipython in c:\users\malec\anaconda3\lib\site-packages (from ipython-sql) (8.15.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\malec\anaconda3\lib\site-packages (from ipython-sql) (2.0.28)
Requirement already satisfied: sqlparse in c:\users\malec\anaconda3\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in c:\users\malec\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\malec\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\malec\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.7.1)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\malec\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)
Requirement already satisfied: backcall in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pickleshare in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.36)
Requirement already satisfied: pygments>=2.4.0 in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: colorama in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\malec\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\malec\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing in c:\users\malec\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\malec\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\malec\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: python-decouple in c:\users\malec\anaconda3\lib\site-packages (3.8)

Now we connect to the database.

In [3]:
from decouple import config

%sql postgresql://postgres:{config('PASSWORD')}@localhost:5432/northwind

We explore the database schema and create some basic views.

In [4]:
%%sql
SELECT
	table_name AS name,
	table_type AS type 
FROM
	information_schema.tables 
WHERE
	table_schema = 'public' 
	AND table_type IN 
	(
		'BASE TABLE',
		'VIEW' 
	)
;

 * postgresql://postgres:***@localhost:5432/northwind
17 rows affected.

[('territories', 'BASE TABLE'),
 ('order_details', 'BASE TABLE'),
 ('employee_territories', 'BASE TABLE'),
 ('us_states', 'BASE TABLE'),
 ('customers', 'BASE TABLE'),
 ('orders', 'BASE TABLE'),
 ('employees', 'BASE TABLE'),
 ('shippers', 'BASE TABLE'),
 ('products', 'BASE TABLE'),
 ('categories', 'BASE TABLE'),
 ('suppliers', 'BASE TABLE'),
 ('region', 'BASE TABLE'),
 ('customer_demographics', 'BASE TABLE'),
 ('customer_customer_demo', 'BASE TABLE'),
 ('view_orders_customers', 'VIEW'),
 ('view_orders_details', 'VIEW'),
 ('view_employees_orders', 'VIEW')]

In [5]:
%%sql
CREATE VIEW view_orders_customers AS 
SELECT
	orders.*,
	c.company_name,
	c.contact_name,
	c.contact_title,
	c.address,
	c.city,
	c.region,
	c.postal_code,
	c.country,
	c.phone,
	c.fax 
FROM
	orders 
	LEFT JOIN
		customers AS c 
		ON orders.customer_id = c.customer_id;

 * postgresql://postgres:***@localhost:5432/northwind
(psycopg2.errors.DuplicateTable) relation "view_orders_customers" already exists

[SQL: CREATE VIEW view_orders_customers AS
SELECT
	orders.*,
	c.company_name,
	c.contact_name,
	c.contact_title,
	c.address,
	c.city,
	c.region,
	c.postal_code,
	c.country,
	c.phone,
	c.fax
FROM
	orders
	LEFT JOIN
		customers AS c
		ON orders.customer_id = c.customer_id;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [6]:
%%sql
CREATE VIEW view_orders_details AS 
SELECT
	order_details.*,
	p.product_name,
	o.customer_id,
	o.ship_name,
	o.ship_city,
	o.ship_country 
FROM
	order_details 
	LEFT JOIN
		products AS p 
		ON order_details.product_id = p.product_id 
	LEFT JOIN
		orders AS o 
		ON order_details.order_id = o.order_id;

 * postgresql://postgres:***@localhost:5432/northwind
(psycopg2.errors.DuplicateTable) relation "view_orders_details" already exists

[SQL: CREATE VIEW view_orders_details AS
SELECT
	order_details.*,
	p.product_name,
	o.customer_id,
	o.ship_name,
	o.ship_city,
	o.ship_country
FROM
	order_details
	LEFT JOIN
		products AS p
		ON order_details.product_id = p.product_id
	LEFT JOIN
		orders AS o
		ON order_details.order_id = o.order_id;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [7]:
%%sql
CREATE VIEW view_employees_orders AS 
SELECT
	e.employee_id,
	e.last_name,
	e.first_name,
	e.title,
	e.hire_date,
	e.birth_date,
	e.country,
	o.order_id,
	o.customer_id 
FROM
	employees AS e 
	LEFT JOIN
		orders AS o 
		ON e.employee_id = o.employee_id

 * postgresql://postgres:***@localhost:5432/northwind
(psycopg2.errors.DuplicateTable) relation "view_employees_orders" already exists

[SQL: CREATE VIEW view_employees_orders AS
SELECT
	e.employee_id,
	e.last_name,
	e.first_name,
	e.title,
	e.hire_date,
	e.birth_date,
	e.country,
	o.order_id,
	o.customer_id
FROM
	employees AS e
	LEFT JOIN
		orders AS o
		ON e.employee_id = o.employee_id]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [8]:
%sql SELECT * FROM view_orders_customers LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', 'Vins et alcools Chevalier', 'Paul Henriot', 'Accounting Manager', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', '26.47.15.10', '26.47.15.11'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', 'Toms Spezialitäten', 'Karin Josephs', 'Marketing Manager', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', '0251-031259', '0251-035695'),
 (10250, 'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil', 'Hanari Carnes', 'Mario Pontes', 'Accounting Manager', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil', '(21) 555-0091', '(21) 555-8765'),
 (10251, 'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, 'Victuailles en stock', '2, rue du Commerce', 'Lyon', None, '69004', 'France', 'Victuailles en stock', 'Mary Saveley', 'Sales Agent', '2, rue du Commerce', 'Lyon', None, '69004', 'France', '78.32.54.86', '78.32.54.87'),
 (10252, 'SUPRD', 4, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), 2, 51.3, 'Suprêmes délices', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium', 'Suprêmes délices', 'Pascale Cartrain', 'Accounting Manager', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium', '(071) 23 67 22 20', '(071) 23 67 22 21')]

In [9]:
%sql SELECT * FROM view_orders_details LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(10248, 11, 14.0, 12, 0.0, 'Queso Cabrales', 'VINET', 'Vins et alcools Chevalier', 'Reims', 'France'),
 (10248, 42, 9.8, 10, 0.0, 'Singaporean Hokkien Fried Mee', 'VINET', 'Vins et alcools Chevalier', 'Reims', 'France'),
 (10248, 72, 34.8, 5, 0.0, 'Mozzarella di Giovanni', 'VINET', 'Vins et alcools Chevalier', 'Reims', 'France'),
 (10249, 14, 18.6, 9, 0.0, 'Tofu', 'TOMSP', 'Toms Spezialitäten', 'Münster', 'Germany'),
 (10249, 51, 42.4, 40, 0.0, 'Manjimup Dried Apples', 'TOMSP', 'Toms Spezialitäten', 'Münster', 'Germany')]

In [10]:
%sql SELECT * FROM view_employees_orders LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(1, 'Davolio', 'Nancy', 'Sales Representative', datetime.date(1992, 5, 1), datetime.date(1948, 12, 8), 'USA', 10258, 'ERNSH'),
 (1, 'Davolio', 'Nancy', 'Sales Representative', datetime.date(1992, 5, 1), datetime.date(1948, 12, 8), 'USA', 10270, 'WARTH'),
 (1, 'Davolio', 'Nancy', 'Sales Representative', datetime.date(1992, 5, 1), datetime.date(1948, 12, 8), 'USA', 10275, 'MAGAA'),
 (1, 'Davolio', 'Nancy', 'Sales Representative', datetime.date(1992, 5, 1), datetime.date(1948, 12, 8), 'USA', 10285, 'QUICK'),
 (1, 'Davolio', 'Nancy', 'Sales Representative', datetime.date(1992, 5, 1), datetime.date(1948, 12, 8), 'USA', 10292, 'TRADH')]

---
# Data analysis

Rank employees based on their total sales.

In [11]:
%%sql
WITH total_sales_per_employee AS 
(
	SELECT
		o.employee_id,
		SUM(d.unit_price * d.quantity * (1 - d.discount)) AS "Total sales" 
	FROM
		order_details AS d 
		LEFT JOIN
			orders AS o 
			ON d.order_id = o.order_id 
	GROUP BY
		o.employee_id 
)
SELECT
	RANK() OVER (ORDER BY "Total sales" DESC) AS "Employee rank",
	total_sales_per_employee.employee_id 
FROM
	total_sales_per_employee LIMIT 10;

 * postgresql://postgres:***@localhost:5432/northwind
9 rows affected.

[(1, 4), (2, 3), (3, 1), (4, 2), (5, 8), (6, 7), (7, 9), (8, 6), (9, 5)]

Explore sales progress on a monthly basis.

In [12]:
%%sql
WITH monthly_sales AS 
(
	SELECT
		DATE_TRUNC('month', o.order_date)::DATE AS "Month",
		SUM(d.unit_price * d.quantity * (1 - d.discount)) AS "Monthly sales" 
	FROM
		orders AS o 
		LEFT JOIN
			order_details AS d 
			ON o.order_id = d.order_id 
	GROUP BY
		DATE_TRUNC('month', o.order_date) 
)
SELECT
	*,
	SUM("Monthly sales") OVER (ORDER BY	"Month") AS "Sales total" 
FROM
	monthly_sales 
ORDER BY
	"Month";

 * postgresql://postgres:***@localhost:5432/northwind
23 rows affected.

[(datetime.date(1996, 7, 1), 27861.89512966156, 27861.89512966156),
 (datetime.date(1996, 8, 1), 25485.275070743264, 53347.17020040483),
 (datetime.date(1996, 9, 1), 26381.400132587554, 79728.57033299239),
 (datetime.date(1996, 10, 1), 37515.72494547888, 117244.29527847127),
 (datetime.date(1996, 11, 1), 45600.04521113701, 162844.3404896083),
 (datetime.date(1996, 12, 1), 45239.630493214434, 208083.97098282274),
 (datetime.date(1997, 1, 1), 61258.0701679784, 269342.0411508011),
 (datetime.date(1997, 2, 1), 38483.6349503243, 307825.6761011254),
 (datetime.date(1997, 3, 1), 38547.22010972678, 346372.8962108522),
 (datetime.date(1997, 4, 1), 53032.95238894149, 399405.8485997937),
 (datetime.date(1997, 5, 1), 53781.28982514166, 453187.13842493534),
 (datetime.date(1997, 6, 1), 36362.80233480245, 489549.9407597378),
 (datetime.date(1997, 7, 1), 51020.85751860481, 540570.7982783426),
 (datetime.date(1997, 8, 1), 47287.66968825523, 587858.4679665978),
 (datetime.date(1997, 9, 1), 55629.24240174934, 643487.7103683471),
 (datetime.date(1997, 10, 1), 66749.22577572716, 710236.9361440743),
 (datetime.date(1997, 11, 1), 43533.80876756514, 753770.7449116395),
 (datetime.date(1997, 12, 1), 71398.42846388379, 825169.1733755233),
 (datetime.date(1998, 1, 1), 94222.1102069358, 919391.2835824591),
 (datetime.date(1998, 2, 1), 99415.2873830082, 1018806.5709654673),
 (datetime.date(1998, 3, 1), 104854.15500015698, 1123660.7259656242),
 (datetime.date(1998, 4, 1), 123798.6822555472, 1247459.4082211715),
 (datetime.date(1998, 5, 1), 18333.630432192596, 1265793.0386533642)]

Calculate the percentage change in sales from one month to the next.

In [25]:
%%sql
WITH monthly_sales AS 
(
	SELECT
		DATE_TRUNC('month', o.order_date)::DATE AS "Month",
		SUM(d.unit_price * d.quantity * (1 - d.discount)) AS "Monthly sales" 
	FROM
		orders AS o 
		LEFT JOIN
			order_details AS d 
			ON o.order_id = d.order_id 
	GROUP BY
		DATE_TRUNC('month', o.order_date) 
)
,
monthly_sales_diffs AS 
(
	SELECT
		*,
		"Monthly sales" - LAG("Monthly sales", 1) OVER (ORDER BY "Month") AS "Sales diff" 
	FROM
		monthly_sales 
)
SELECT
	*,
	"Sales diff" / LAG("Monthly sales", 1) OVER (ORDER BY "Month") * 100 AS "Growth rate [%]" 
FROM
	monthly_sales_diffs;

 * postgresql://postgres:***@localhost:5432/northwind
23 rows affected.

[(datetime.date(1996, 7, 1), 27861.89512966156, None, None),
 (datetime.date(1996, 8, 1), 25485.275070743264, -2376.6200589182954, -8.530001451294545),
 (datetime.date(1996, 9, 1), 26381.400132587554, 896.12506184429, 3.51624637896504),
 (datetime.date(1996, 10, 1), 37515.72494547888, 11134.32481289133, 42.20520805162909),
 (datetime.date(1996, 11, 1), 45600.04521113701, 8084.320265658127, 21.54915112904513),
 (datetime.date(1996, 12, 1), 45239.630493214434, -360.41471792257653, -0.7903823696967553),
 (datetime.date(1997, 1, 1), 61258.0701679784, 16018.43967476397, 35.40798079057388),
 (datetime.date(1997, 2, 1), 38483.6349503243, -22774.435217654107, -37.17785290199861),
 (datetime.date(1997, 3, 1), 38547.22010972678, 63.58515940248617, 0.16522649038887202),
 (datetime.date(1997, 4, 1), 53032.95238894149, 14485.73227921471, 37.579187910257275),
 (datetime.date(1997, 5, 1), 53781.28982514166, 748.3374362001705, 1.4110800973551207),
 (datetime.date(1997, 6, 1), 36362.80233480245, -17418.487490339212, -32.38763433709323),
 (datetime.date(1997, 7, 1), 51020.85751860481, 14658.05518380236, 40.31057631048775),
 (datetime.date(1997, 8, 1), 47287.66968825523, -3733.1878303495832, -7.316983704141531),
 (datetime.date(1997, 9, 1), 55629.24240174934, 8341.572713494112, 17.64005874784288),
 (datetime.date(1997, 10, 1), 66749.22577572716, 11119.983373977819, 19.98945679265288),
 (datetime.date(1997, 11, 1), 43533.80876756514, -23215.417008162018, -34.780054357730286),
 (datetime.date(1997, 12, 1), 71398.42846388379, 27864.619696318645, 64.00685004404939),
 (datetime.date(1998, 1, 1), 94222.1102069358, 22823.681743052017, 31.966644412344674),
 (datetime.date(1998, 2, 1), 99415.2873830082, 5193.177176072393, 5.511633272346428),
 (datetime.date(1998, 3, 1), 104854.15500015698, 5438.86761714879, 5.47085640480519),
 (datetime.date(1998, 4, 1), 123798.6822555472, 18944.527255390218, 18.06750267107856),
 (datetime.date(1998, 5, 1), 18333.630432192596, -105465.0518233546, -85.1907709370056)]

Identify the most important customers (above-average total orders / high-value customers).

**? Print the average value.**

In [54]:
%%sql
WITH customers_orders AS 
(
	SELECT
		c.customer_id,
		c.company_name,
		SUM(d.unit_price * d.quantity * (1 - d.discount)) AS "Total orders" 
	FROM
		orders AS o 
		LEFT JOIN
			customers AS c 
			ON o.customer_id = c.customer_id 
		LEFT JOIN
			order_details AS d 
			ON o.order_id = d.order_id 
	GROUP BY
		c.customer_id 
)
SELECT
	customer_id,
	company_name,
	"Total orders" 
FROM
	customers_orders 
WHERE
	"Total orders" > ( 
	SELECT
		AVG("Total orders") 
	FROM
		customers_orders );

 * postgresql://postgres:***@localhost:5432/northwind
30 rows affected.

[('OLDWO', 'Old World Delicatessen', 15177.462503358722),
 ('WARTH', 'Wartian Herkku', 15648.702585553974),
 ('QUEEN', 'Queen Cozinha', 25717.497604973578),
 ('RATTC', 'Rattlesnake Canyon Grocery', 51097.80082826822),
 ('FRANK', 'Frankenversand', 26656.559403990017),
 ('LEHMS', 'Lehmanns Marktstand', 19261.409954871837),
 ('LINOD', 'LINO-Delicateses', 16476.56491531938),
 ('QUICK', 'QUICK-Stop', 110277.30503039382),
 ('HUNGO', 'Hungry Owl All-Night Grocers', 49979.90508149549),
 ('KOENE', 'Königlich Essen', 30908.383872538416),
 ('MEREP', 'Mère Paillarde', 28872.19015611842),
 ('BONAP', "Bon app'", 21963.252461684533),
 ('HANAR', 'Hanari Carnes', 32841.369948457475),
 ('SEVES', 'Seven Seas Imports', 16215.325044126435),
 ('BERGS', 'Berglunds snabbköp', 24927.577430965972),
 ('FOLKO', 'Folk och fä HB', 29567.562490026656),
 ('SAVEA', 'Save-a-lot Markets', 104361.94954039395),
 ('BLONP', 'Blondesddsl père et fils', 18534.080079345105),
 ('VAFFE', 'Vaffeljernet', 15843.924896007406),
 ('HILAA', 'HILARION-Abastos', 22768.76392572349),
 ('EASTC', 'Eastern Connection', 14761.034930229187),
 ('PICCO', 'Piccolo und mehr', 23128.86001497373),
 ('ERNSH', 'Ernst Handel', 104874.97814367746),
 ('SUPRD', 'Suprêmes délices', 24088.780281318428),
 ('GREAL', 'Great Lakes Food Market', 18507.44997092657),
 ('SIMOB', 'Simons bistro', 16817.097612204925),
 ('LILAS', 'LILA-Supermercado', 16076.599920950532),
 ('WHITC', 'White Clover Markets', 27363.604900210797),
 ('RICSU', 'Richter Supermarkt', 19343.778920320852),
 ('BOTTM', 'Bottom-Dollar Markets', 20801.59995229095)]

---
# Findings

Percentage of total sales for each product category.

In [64]:
%%sql
WITH categories_sales AS 
(
	SELECT
		c.category_name,
		SUM(d.unit_price * d.quantity * (1 - d.discount)) AS "Total sales" 
	FROM
		order_details AS d 
		LEFT JOIN
			products AS p 
			ON d.product_id = p.product_id 
		LEFT JOIN
			categories as c 
			ON p.category_id = c.category_id 
	GROUP BY
		c.category_id 
)
SELECT
	*,
	"Total sales" / SUM("Total sales") OVER () * 100 AS "Sales share [%]" 
FROM
	categories_sales 
ORDER BY
	"Sales share [%]" DESC;

 * postgresql://postgres:***@localhost:5432/northwind
8 rows affected.

[('Beverages', 267868.17978624784, 21.162083500729633),
 ('Dairy Products', 234507.2845305777, 18.52651084098727),
 ('Confections', 167357.22547338586, 13.221531511299172),
 ('Meat/Poultry', 163022.3602687388, 12.879069112449296),
 ('Seafood', 131261.7365558489, 10.369920875492724),
 ('Condiments', 106047.08460955074, 8.3779165607018),
 ('Produce', 99984.58007357619, 7.8989674473124385),
 ('Grains/Cereals', 95744.58735543818, 7.5640001510276695)]

---
# Conclusions